<?php
require('fpdf.php');

class PDF extends FPDF
  {
  // Page header
    function Header()
    {
        // Arial bold 15
        $this->AddFont('angsana','b','angsa.php');
        $this->SetFont('angsana','b',25);
        
        // Title
        $this->SetTextColor(0,0,0);
        $this->Cell(0,5, iconv( 'UTF-8','cp874' ,'ใบสั่งสินค้า') , 0 , 1,'C' ); 
        $this->Ln(2);
        $this->SetFont('angsana','',14);
        $this->Cell(0,5, iconv( 'UTF-8','cp874' ,'ทีมงานคุณดารุณี ที่ตั้ง 31/1 ม.12 ต.สันสลี อ.เวียงป่าเป้า จ.เชียงราย 57170 โทร.081-916-9852') , 0 , 1,'C' );
        $this->Cell(0,5, iconv( 'UTF-8','cp874' ,'________________________________________________________________________________________________') , 0 , 1,'L' ); 
        $this->Ln(8);
      }
  }

// Instanciation of inherited class
$pdf=new PDF('P','mm','A4');
            // ตั้งค่าขอบกระดาษทุกด้าน 20 มิลลิเมตร
            $pdf->AliasNbPages();
            $pdf->SetMargins(27, 20 ,20);
            $pdf->AddFont('angsana','','angsa.php');
            $pdf->SetFont('angsana','',18);
            
              //สร้างหน้าเอกสาร
              $pdf->AddPage();
              $pdf->SetTextColor(255,0,0);
              $pdf->SetFont('angsana','',20);


              
              $pdf->SetTextColor(255,0,0);
              $pdf->SetFont('angsana','',25);
              $pdf->Text(150, 48,iconv('UTF-8','cp874','SL111'),1,0,'C');
              $pdf->Text(60, 88,iconv('UTF-8','cp874','SOLE'),1,0,'L');
              $pdf->Text(77, 98,iconv('UTF-8','cp874','320'.'    '.'กส.'),1,0,'L');
              $pdf->SetTextColor(0,0,0);
              $pdf->SetFont('angsana','',18);
              $pdf->Text(195, 10,iconv('UTF-8','cp874','1'),1,0,'C');
              $pdf->Text(140, 58,iconv('UTF-8','cp874','29 มิ.ย. 63 '),1,0,'C');
              $pdf->Text(55, 119,iconv('UTF-8','cp874','ร้านทีมงานคุณดารุณี'.'    '.'อ.'.'จุน'.'   จ.'.'พะเยา'),1,0,'C');
              $pdf->Text(75, 127,iconv('UTF-8','cp874','อั๋น'),1,0,'C');
              $pdf->Text(132, 127,iconv('UTF-8','cp874','090-472-3625'),1,0,'L');
              $pdf->Text(60, 147,iconv('UTF-8','cp874','คุณ พงษ์ศักดิ์ บุญช่วย'),1,0,'L');
              $pdf->Text(132, 147,iconv('UTF-8','cp874','062-350-1935'),1,0,'C');
              $pdf->Text(70, 155,iconv('UTF-8','cp874','พ่วง'),1,0,'C');
              $pdf->Text(132, 154,iconv('UTF-8','cp874','70-4650 ตาก'),1,0,'L');
              $pdf->Text(79, 163,iconv('UTF-8','cp874','29 มิ.ย. 63'),1,0,'C');
              $pdf->Text(57, 182,iconv('UTF-8','cp874','เบส'),1,0,'C');
              $pdf->Cell(0,5, iconv( 'UTF-8','cp874' ,'                                                                                               ใบสั่งที่ ......................................') , 0 , 1,'C' );
              $pdf->Ln(5);

              $pdf->Cell(0,5, iconv( 'UTF-8','cp874' ,'                                                                         วันที่ .................................................................') , 0 , 1,'C' );
              $pdf->Ln(5);
              $pdf->Cell(0,5, iconv( 'UTF-8','cp874' ,'') , 0 , 1,'L' );
              $pdf->Ln(5);
              $pdf->Cell(0,5, iconv( 'UTF-8','cp874' ,'สินค้า : ') , 0 , 1,'L' ); 
              $pdf->Ln(5);
              $pdf->Cell(0,5, iconv( 'UTF-8','cp874' ,'                สินค้า ........................................................................................................................') , 0 , 1,'L' );
              $pdf->Ln(5);
              $pdf->Cell(0,5, iconv( 'UTF-8','cp874' ,'                จำนวน ......................................................................................................................') , 0 , 1,'L' );
              $pdf->Ln(8);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'ผู้รับของ : ') , 0 , 1,'L' );
              $pdf->Ln(4);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'                ...................................................................................................................................') , 0 , 1,'L' );
              $pdf->Ln(4);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'                ผู้ประสานงาน ............................................... โทร ...................................................') , 0 , 1,'L' );
              $pdf->Ln(8);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'ข้อมูลรถ : ') , 0 , 1,'L' );
              $pdf->Ln(4);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'                พขร. .............................................................. โทร ...................................................') , 0 , 1,'L' );
              $pdf->Ln(4);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'                ประเภทรถ ......................................... ทะเบียนรถ ....................................................') , 0 , 1,'L' );
              $pdf->Ln(4);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'                วันที่เข้าโรงงาน .............................................') , 0 , 1,'L' );
              $pdf->Ln(8);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'ผู้ออกใบสั่ง : ') , 0 , 1,'L' );
              $pdf->Ln(4);
              $pdf->Cell(0,4, iconv( 'UTF-8','cp874' ,'                 ......................................................................') , 0 , 1,'L' );                     
              $pdf->Ln(8);
              $pdf->Image('Signed.jpg',140,170,40,0,'','');
              $pdf->Text(157, 228,iconv('UTF-8','cp874','ผู้สั่ง'),1,0,'C');
              $pdf->Text(20, 275,iconv('UTF-8','cp874','หมายเหตุ : รถคันนี้ ขนส่งสินค้า จำนวน..........ใบสั่ง'),1,0,'L');
              //$pdf->Text(91, 274,iconv('UTF-8','cp874',''),1,0,'L');
              
// --------------------------------------------------------------------------------------                     
    $pdf->Output();
?>