<?php
define('FPDF_FONTPATH','font/');

require('fpdf.php');

$pdf=new FPDF();
$pdf->SetMargins( 15,15,10 );
// เพิ่มฟ้อนต์ภาษาไทยเข้ามา ตัวธรรมดา กำหนด ชื่อ เป็น angsana
$pdf->AddFont('angsana','','angsa.php');

//สร้างหน้าเอกสาร
$pdf->AddPage();

// กำหนดฟ้อนต์ที่จะใช้  อังสนา ตัวธรรมดา ขนาด 14
$pdf->SetFont('angsana','',14);

// พิมพ์ข้อความลงเอกสาร
$pdf->Cell(0  ,  5, iconv( 'UTF-8','cp874' , 'แบบคำขอใช้น้ำประปา' ) , 0 , 1 , 'C' );
$pdf->Cell(0  ,  5, iconv( 'UTF-8','cp874' , 'กองการประปาตำบลบ้านถ้ำ' ) , 0 , 1 , 'C' );
$pdf->Cell(0  , 15, iconv( 'UTF-8','cp874' , 'เขียนที่   ................................................' ),0,1,'R');
$pdf->Cell(0  ,  5, iconv( 'UTF-8','cp874' , 'วันที่ ................เดือน.......................พ.ศ...............' ),0,1,'R');
$pdf->Ln(5);
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๑.  ขอติดตั้งมาตรวัตน้ำ.............นิ้ว' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๒.  ขอย้ายมาตรวัตน้ำ                    ' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๓.  ขอใช้น้ำประปาชั่วคราว           ' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , ' ข้อ ๔.  ขอโอนประเภทการใช้น้ำ         ' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๕.  อื่นๆ.........................................' ),0,1,'R');
$pdf->Ln(5);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'ข้าพเจ้า.........................................................................................อายุ................ปี' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'เกิดวันที่.................................เลขบัตรประชาชน........................................................................................วันหมดอายุ........................................' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'อยู่บ้านเลขที่.................หมู่ที่....................ถนน......................................   ตำบล............บ้านถ้ำ...........  อำเภอ..............ดอกคำใต้................' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'จังหวัด .........พะเยา.........รหัสไปรษณีย์.........๕๖๑๒๐.........  อาชีพ.............................................  สถานที่ทำงาน..............................................' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'โทรศัพท์ ....................................'),0,1);
$pdf->cell(5 , 7, iconv( 'UTF-8','cp874' ,'มีความประสงค์จะดำเนินการตามข้อ...................  สำหรับบ้านเลขที่.................  หมู่ที่..................  ถนน........................  ตำบล.....บ้านถ้ำ.......'),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'อำเภอ.............ดอกคำใต้.............  จังหวัด..........พะเยา...........  โดยมีท่อประปาผ่านหน้าบ้านขนาด..................มม.'),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'ในการชำระเงินค่าติดตั้งระบบประปา ข้าพเจ้าได้เเจ้งความจำนงการชำระเงินค่าติดตั้งระบบประปาโดย ' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'ข้อ ๑.   หักเงินบัญชีฝากธนาคาร.......................................จำกัด  สาขา......................................  เลขที่บัญชื............................................ '),0,1);
$pdf->Cell(0 , 5, iconv( 'UTF-8','cp874' ,'            ประเภทบัญชี..............................  ชื่อบัญชี...................................' ),0,1);
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'ข้อ ๒.  ชำระที่สำนักงานเทศบาลตำบลบ้านถ้ำด้วยตนเอง' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'ข้อ ๓.  ชำระผ่านสื่ออื่น ๆ เช่น ผ่านบริการตัวเเทนเก็บเงินของเทศบาลฯ ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'         ข้าพเจ้ายินดีที่จะให้ความสะดวกเเก่เจ้าหน้าที่ของการประปาตำบลบ้านถ้ำในการสำรวจเเละปฏิบัติตามระเบียบ ข้อบังคับของกองการ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'ประปาเทศบาลตำบลบ้านถ้ำเกี่ยวกับการขอใช้น้ำประปาทุกประการ ซึ่งเจ้าหน้าที่ได้ชี้เเจงให้ข้าพเจ้าได้ทราบเเล้ว' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'เอกสารยื่นประกอบการยื่นคำขอ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'๑.   บัตรประจำตัวประชาน                                                                                    (ลงชื่อ)......................................(ผู้ขอใช้น้ำประปา)' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'๒.   สำเนาทะเบียนบ้าน                                                                                                 (..........................................)' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'๓.   หลักฐานอื่นๆ' ) , 0 , 1  );
$pdf->Cell(0 , 10 ,iconv( 'UTF-8','cp874' ,'________________________________________________________________________________________________________') , 0 , 1  );
$pdf->Ln(5);
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'เรียน   นายกเทศมนตรีฯ  เพื่อโปรดพิจารณาอนุมัติ                                                                   อนุมัติ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'(ลงชื่อ)..............................................                                                                (ลงชื่อ)..............................................' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'              (นาย  ราชันย์   สิทธิตัน )                                                                               (นายกฤษณพันธ์    ผดุงศร)' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'           นายช่างไฟฟ้า    ปฏิบัติหน้าที่                                                                 รองนายกเทศมนตรี   ปฏิบัติการเเทน' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'                  หัวหน้าการประปา                                                                                  นายกเทศมนตรีตำบลบ้านถ้ำ' ) , 0 , 1  );

$pdf->AddPage();
$pdf->SetFont('angsana','',14);

// พิมพ์ข้อความลงเอกสาร
$pdf->Cell(0  ,  5, iconv( 'UTF-8','cp874' , 'แบบคำขอใช้น้ำประปา' ) , 0 , 1 , 'C' );
$pdf->Cell(0  ,  5, iconv( 'UTF-8','cp874' , 'กองการประปาตำบลบ้านถ้ำ' ) , 0 , 1 , 'C' );
$pdf->Cell(0  , 15, iconv( 'UTF-8','cp874' , 'เขียนที่   ................................................' ),0,1,'R');
$pdf->Cell(0  ,  5, iconv( 'UTF-8','cp874' , 'วันที่ ................เดือน.......................พ.ศ...............' ),0,1,'R');
$pdf->Ln(5);
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๑.  ขอติดตั้งมาตรวัตน้ำ.............นิ้ว' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๒.  ขอย้ายมาตรวัตน้ำ                    ' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๓.  ขอใช้น้ำประปาชั่วคราว           ' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , ' ข้อ ๔.  ขอโอนประเภทการใช้น้ำ         ' ),0,1,'R');
$pdf->Cell(0  , 7, iconv( 'UTF-8','cp874' , 'ข้อ ๕.  อื่นๆ.........................................' ),0,1,'R');
$pdf->Ln(5);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'ข้าพเจ้า.........................................................................................อายุ................ปี' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'เกิดวันที่.................................เลขบัตรประชาชน........................................................................................วันหมดอายุ........................................' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'อยู่บ้านเลขที่.................หมู่ที่....................ถนน......................................   ตำบล............บ้านถ้ำ...........  อำเภอ..............ดอกคำใต้................' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' , 'จังหวัด .........พะเยา.........รหัสไปรษณีย์.........๕๖๑๒๐.........  อาชีพ.............................................  สถานที่ทำงาน..............................................' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'โทรศัพท์ ....................................'),0,1);
$pdf->cell(5 , 7, iconv( 'UTF-8','cp874' ,'มีความประสงค์จะดำเนินการตามข้อ...................  สำหรับบ้านเลขที่.................  หมู่ที่..................  ถนน........................  ตำบล.....บ้านถ้ำ.......'),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'อำเภอ.............ดอกคำใต้.............  จังหวัด..........พะเยา...........  โดยมีท่อประปาผ่านหน้าบ้านขนาด..................มม.'),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'ในการชำระเงินค่าติดตั้งระบบประปา ข้าพเจ้าได้เเจ้งความจำนงการชำระเงินค่าติดตั้งระบบประปาโดย ' ),0,1);
$pdf->Cell(0 , 7, iconv( 'UTF-8','cp874' ,'ข้อ ๑.   หักเงินบัญชีฝากธนาคาร.......................................จำกัด  สาขา......................................  เลขที่บัญชื............................................ '),0,1);
$pdf->Cell(0 , 5, iconv( 'UTF-8','cp874' ,'            ประเภทบัญชี..............................  ชื่อบัญชี...................................' ),0,1);
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'ข้อ ๒.  ชำระที่สำนักงานเทศบาลตำบลบ้านถ้ำด้วยตนเอง' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'ข้อ ๓.  ชำระผ่านสื่ออื่น ๆ เช่น ผ่านบริการตัวเเทนเก็บเงินของเทศบาลฯ ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'         ข้าพเจ้ายินดีที่จะให้ความสะดวกเเก่เจ้าหน้าที่ของการประปาตำบลบ้านถ้ำในการสำรวจเเละปฏิบัติตามระเบียบ ข้อบังคับของกองการ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'ประปาเทศบาลตำบลบ้านถ้ำเกี่ยวกับการขอใช้น้ำประปาทุกประการ ซึ่งเจ้าหน้าที่ได้ชี้เเจงให้ข้าพเจ้าได้ทราบเเล้ว' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'เอกสารยื่นประกอบการยื่นคำขอ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'๑.   บัตรประจำตัวประชาน                                                                                    (ลงชื่อ)......................................(ผู้ขอใช้น้ำประปา)' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'๒.   สำเนาทะเบียนบ้าน                                                                                                 (..........................................)' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'๓.   หลักฐานอื่นๆ' ) , 0 , 1  );
$pdf->Cell(0 , 10 ,iconv( 'UTF-8','cp874' ,'________________________________________________________________________________________________________') , 0 , 1  );
$pdf->Ln(5);  
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'เรียน   นายกเทศมนตรีฯ  เพื่อโปรดพิจารณาอนุมัติ                                                                   อนุมัติ' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'(ลงชื่อ)..............................................                                                                (ลงชื่อ)..............................................' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'              (นาย  ราชันย์   สิทธิตัน )                                                                               (นายกฤษณพันธ์    ผดุงศร)' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'           นายช่างไฟฟ้า    ปฏิบัติหน้าที่                                                                 รองนายกเทศมนตรี   ปฏิบัติการเเทน' ) , 0 , 1  );
$pdf->Cell(0 , 7 ,iconv( 'UTF-8','cp874' ,'                  หัวหน้าการประปา                                                                                  นายกเทศมนตรีตำบลบ้านถ้ำ' ) , 0 , 1  );


$pdf->Output();
?>